export default function ShopCSRPage() {
  // CSR (Client-Side Rendering - Рендерінг на клієнті) - це динаміка яка формується 
  // на стороні клієнта: такий спосіб рендеру підходить для адмінок  і особистих кабінетів 
  // де не потрібна SEO оптимізація, все навантаження на стороні клієнта

  return (
    <span className="">
      CSR (Client-Side Rendering - Рендерінг на клієнті) - це динаміка яка формується 
      на стороні клієнта: такий спосіб рендеру підходить для адмінок і особистих кабінетів 
      де не потрібна SEO оптимізація, все навантаження на стороні клієнта
    </span>
  );
}